; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl)

(:types link joint angle)
(:predicates
    (Connected ?j - joint ?l - link) 
    (AngleOrd ?a - angle ?a1 - angle)
    (HasAngle ?a - angle ?j - joint)
    (IsChildOf ?child - link ?parent - link)
)

(:action increase_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
    (IsChildOf ?link1 ?link2)
    (Connected ?joint ?link1)
    (Connected ?joint ?link2)
    (not (= ?link1 ?link2))
    (HasAngle ?a1 ?joint)
    (AngleOrd ?a1 ?a2)
    )
:effect (and 
    (not (HasAngle ?a1 ?joint)) 
    (HasAngle ?a2 ?joint)
    )
)

(:action decrease_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
    (IsChildOf ?link1 ?link2)
    (Connected ?joint ?link1)
    (Connected ?joint ?link2)
    (not (= ?link1 ?link2))
    (HasAngle ?a1 ?joint)
    (AngleOrd ?a2 ?a1)
    )
:effect (and 
    (not (HasAngle ?a1 ?joint)) 
    (HasAngle ?a2 ?joint)
    )
)
)

; problem
(define (problem joint_bar_1)
(:domain joint_bar)
(:objects
    link_ground link1 link2 link3 link4 link5 link6 link7 - link
    joint_ground joint1 joint2 joint3 joint4 joint5 joint6 - joint
    angle0 angle90 angle180 angle270 - angle)
(:init
    (AngleOrd angle0 angle90)
    (AngleOrd angle90 angle180)
    (AngleOrd angle180 angle270)
    (AngleOrd angle270 angle0)

    (IsChildOf link1 link_ground)
    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)

    (Connected joint_ground link_ground)
    (Connected joint_ground link1)
    (Connected joint1 link1)
    (Connected joint1 link2)
    (Connected joint2 link2)
    (Connected joint2 link3)
    (Connected joint3 link3)
    (Connected joint3 link4)
    (Connected joint4 link4)
    (Connected joint4 link5)
    (Connected joint5 link5)
    (Connected joint5 link6)
    (Connected joint6 link6)
    (Connected joint6 link7)

    (HasAngle angle90 joint_ground)
    (HasAngle angle270 joint1)
    (HasAngle angle270 joint2)
    (HasAngle angle0 joint3)
    (HasAngle angle270 joint4)
    (HasAngle angle0 joint5)
    (HasAngle angle180 joint6)
)
(:goal
(and
    (HasAngle angle270 joint_ground)
    (HasAngle angle270 joint1)
    (HasAngle angle270 joint2)
    (HasAngle angle180 joint3)
    (HasAngle angle90 joint4)
    (HasAngle angle0 joint5)
    (HasAngle angle180 joint6)
    )
)
)

; plan
1. (decrease_angle link1 link_ground joint_ground angle90 angle0)
   deleted: (hasangle angle90 joint_ground)
   added: (hasangle angle0 joint_ground)
   goals met: 4 of 7
2. (decrease_angle link4 link3 joint3 angle0 angle270)
   deleted: (hasangle angle0 joint3)
   added: (hasangle angle270 joint3)
   goals met: 4 of 7
3. (increase_angle link5 link4 joint4 angle270 angle0)
   deleted: (hasangle angle270 joint4)
   added: (hasangle angle0 joint4)
   goals met: 4 of 7
4. (decrease_angle link1 link_ground joint_ground angle0 angle270)
   deleted: (hasangle angle0 joint_ground)
   added: (hasangle angle270 joint_ground)
   goals met: 5 of 7
5. (decrease_angle link4 link3 joint3 angle270 angle180)
   deleted: (hasangle angle270 joint3)
   added: (hasangle angle180 joint3)
   goals met: 6 of 7
6. (increase_angle link5 link4 joint4 angle0 angle90)
   deleted: (hasangle angle0 joint4)
   added: (hasangle angle90 joint4)
   goals met: 7 of 7
